; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	image0 - mode
	infrared1 - mode
	GroundStation0 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument1 image0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star15)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 image0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation1)
	(calibration_target instrument3 Star5)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 Star5)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon13)
	(supports instrument5 infrared1)
	(supports instrument5 image0)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 infrared1)
	(supports instrument6 image0)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star14)
	(supports instrument7 image0)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 image0)
	(supports instrument8 infrared1)
	(calibration_target instrument8 GroundStation1)
	(calibration_target instrument8 GroundStation3)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
)
(:goal (and
	(pointing satellite1 Planet7)
	(pointing satellite4 Star15)
	(have_image Star6 image0)
	(have_image Planet7 image0)
	(have_image Planet8 image0)
	(have_image Planet9 infrared1)
	(have_image Planet10 infrared1)
	(have_image Phenomenon11 image0)
	(have_image Planet12 infrared1)
	(have_image Phenomenon13 infrared1)
	(have_image Star14 infrared1)
	(have_image Star15 image0)
	(have_image Star16 image0)
))

)

; plan
1. (switch_on instrument8 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument8)
   goals met: 0 of 13
2. (calibrate satellite4 instrument8 groundstation3)
   added: (calibrated instrument8)
   goals met: 0 of 13
3. (turn_to satellite4 planet7 groundstation3)
   deleted: (pointing satellite4 groundstation3)
   added: (pointing satellite4 planet7)
   goals met: 0 of 13
4. (take_image satellite4 planet7 instrument8 image0)
   added: (have_image planet7 image0)
   goals met: 1 of 13
5. (turn_to satellite4 planet12 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 planet12)
   goals met: 1 of 13
6. (take_image satellite4 planet12 instrument8 infrared1)
   added: (have_image planet12 infrared1)
   goals met: 2 of 13
7. (turn_to satellite4 planet10 planet12)
   deleted: (pointing satellite4 planet12)
   added: (pointing satellite4 planet10)
   goals met: 2 of 13
8. (take_image satellite4 planet10 instrument8 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 3 of 13
9. (turn_to satellite4 phenomenon13 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 phenomenon13)
   goals met: 3 of 13
10. (take_image satellite4 phenomenon13 instrument8 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 4 of 13
11. (turn_to satellite4 phenomenon11 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 phenomenon11)
   goals met: 4 of 13
12. (turn_to satellite1 planet7 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 planet7)
   goals met: 5 of 13
13. (take_image satellite4 phenomenon11 instrument8 image0)
   added: (have_image phenomenon11 image0)
   goals met: 6 of 13
14. (turn_to satellite4 planet8 phenomenon11)
   deleted: (pointing satellite4 phenomenon11)
   added: (pointing satellite4 planet8)
   goals met: 6 of 13
15. (take_image satellite4 planet8 instrument8 image0)
   added: (have_image planet8 image0)
   goals met: 7 of 13
16. (turn_to satellite4 planet9 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 planet9)
   goals met: 7 of 13
17. (take_image satellite4 planet9 instrument8 infrared1)
   added: (have_image planet9 infrared1)
   goals met: 8 of 13
18. (turn_to satellite4 star14 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 star14)
   goals met: 8 of 13
19. (take_image satellite4 star14 instrument8 infrared1)
   added: (have_image star14 infrared1)
   goals met: 9 of 13
20. (turn_to satellite4 star16 star14)
   deleted: (pointing satellite4 star14)
   added: (pointing satellite4 star16)
   goals met: 9 of 13
21. (take_image satellite4 star16 instrument8 image0)
   added: (have_image star16 image0)
   goals met: 10 of 13
22. (turn_to satellite4 star6 star16)
   deleted: (pointing satellite4 star16)
   added: (pointing satellite4 star6)
   goals met: 10 of 13
23. (take_image satellite4 star6 instrument8 image0)
   added: (have_image star6 image0)
   goals met: 11 of 13
24. (turn_to satellite4 star15 star6)
   deleted: (pointing satellite4 star6)
   added: (pointing satellite4 star15)
   goals met: 12 of 13
25. (take_image satellite4 star15 instrument8 image0)
   added: (have_image star15 image0)
   goals met: 13 of 13
